[
  {
  "id": 1,
    "name": "*«بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلاثَ مَرَّاتٍ، ثلاثًا » من قالها لَمْ يَضُرَّهُ شَيْءٌ. رواه أبو داود (5088). وهو في الصحيح المسند للإمام الوادعي رحمه الله."
  
},
  {
  "id": 2,
    "name": "صحيح البخاري من حديث أبي هريرة قال الشيطان له: إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح فقال النبي صلى الله عليه وسلم: صدقك وهو كذوب ذاك شيطان."
  
}
,
  {
  "id": 3,
    "name": "عن أبي مسعود البدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : من قرأ بالآيتين من آخر سورة البقرة في ليلةٍ كفتاه . متفق عليه.قيل في معنى الحديث : كفتاه المكروه تلك الليلة. وقيل كفتاه من قيام الليل."
  
}
,
  {
  "id": 4,
    "name": "عن أبي مسعود البدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : من قرأ بالآيتين من آخر سورة البقرة في ليلةٍ كفتاه . متفق عليه.قيل في معنى الحديث : كفتاه المكروه تلك الليلة. وقيل كفتاه من قيام الليل."
  
}
,
  {
  "id": 5,
    "name": "في صحيح ابن حبان عن سهل بن سعد رضي الله عنه قال: قال رسول الله عليه وسلم: إن لكل شيء سناماً، وإن سنام القرآن سورة البقرة، من قرأها في بيته ليلاً لم يدخل الشيطان بيته ثلاث ليال، ومن قرأها نهاراً لم يدخل الشيطان بيته ثلاثة أيام. وفي المستدرك مثله عن أبى هريرة رضي الله عنه."
  
}
,
  {
  "id": 6,
    "name": "في صحيح البخاري ومسلم من حديث أبي موسى رضي الله عنه قول النبي صلى الله عليه وسلم له: قل: لا حول ولا قوة إلا بالله فإنها كنز من كنوز الجنة، أو قال: ألا أدلك على كلمة هي كنز من كنوز الجنة: لا حول ولا قوة إلا بالله."
  
}
,
  {
  "id": 7,
    "name": "في سنن أبي داود والترمذي وابن ماجه ومسند أحمد قال رسول الله صلى الله عليه وسلم: من قال: بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم. ثلاث مرات لم تصبه فجأة بلاء حتى يصبح، ومن قالها حين يصبح ثلاث مرات لم تصبه فجأة بلاء حتى يمسي. وفي رواية : لم يضره شيء."
  }
,
  {
  "id": 8,
    "name": "قال رسول الله صلى الله عليه وسلم: من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق لم يضره شيء حتى يرتحل من منزله ذلك. رواه مسلم.وفي سنن الترمذي ومسند أحمد عن أبي هريرة عن النبي صلى الله عليه وسلم قال: من قال حين يمسي ثلاث مرات أعوذ بكلمات الله التامات من شر ما خلق لم يضره حمة تلك الليلة. الحمة: السم. صححه الألباني."
  }
  ,
  {
  "id": 9,
    "name": "من قال حين يصبح وحين يمسي: حسبي الله لا إله إلا هو، عليه توكلت، وهو رب العرش العظيم. سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة. رواه ابن السني مرفوعًا وأبو داود موقوفًا وصحح إسناده شعيب الأرناؤوط في زاد المعاد."
  }
  ,
  {
  "id": 10,
    "name": "في صحيحي البخاري ومسلم عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك."
  }
  ,
  {
  "id": 11,
    "name": "سنن أبي داود عن أنس بن مالك أن النبي صلى الله عليه وسلم قال: إذا خرج الرجل من بيته فقال: بسم الله توكلت على الله لا حول ولا قوة إلا بالله قال يقال حينئذ: هديت وكفيت ووقيت فتتنحى له الشياطين، فيقول له شيطان آخر: كيف لك برجل قد هدي وكفي ووقي. صححه الألباني."
  }
  ,
  {
  "id": 12,
    "name": "عن عبد الله بن عمرو بن العاص قال: كان رسول الله صلى الله عليه وسلم يقول إذا دخل المسجد قال: أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم قال: فإذا قال ذلك قال الشيطان: حفظ مني سائر اليوم . رواه أبو داود وصححه الألباني."
  }
  ,
  {
  "id": 13,
    "name": "في سنن أبي داود والترمذي عن النبي صلى الله عليه وسلم أنه قال: من قال: أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه. غفر له وإن كان فرَّ من الزحف. صححه الألباني."
  }
  ,
  {
  "id": 14,
    "name": "وفي سنن الترمذي عن الطفيل بن أبي بن كعب عن أبيه قال: كان رسول الله صلى الله عليه وسلم إذا ذهب ثلثا الليل قام فقال: يا أيها الناس اذكروا الله اذكروا الله، جاءت الراجفة تتبعها الرادفة، جاء الموت بما فيه جاء الموت بما فيه. قال أبي: قلت يا رسول الله إني أكثر الصلاة عليك، فكم أجعل لك من صلاتي؟ فقال: ما شئت. قال: قلت الربع؟ قال: ما شئت، فإن زدت فهو خير لك. قلت: النصف؟ قال: ما شئت فإن زدت فهو خير لك. قال: قلت فالثلثين؟ قال: ما شئت فإن زدت فهو خير لك. قلت: أجعل لك صلاتي كلها؟ قال: إذا تكفى همك ويغفر لك ذنبك. قال الترمذي هذا حديث حسن صحيح. وحسنه الألباني. "
  }
  ,
  {
  "id": 15,
    "name": "أخرج البخاري ومسلم عن ابن عباس رضي الله عنهما قال: كان النبي صلى الله عليه وسلم يدعو عند الكرب يقول: لا إله إلا الله العظيم الحليم، لا إله إلا الله رب السموات والأرض ورب العرش العظيم."
  }
 
  ]