import 'dart:math';

import 'package:athkari/app/features/home/presentation/cubit/today_dekhar_cubit_states.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

class TodayDekharCubit extends Cubit<TodayDekharCubitStates> {
  
  TodayDekharCubit() : super(InitialTodayDekharState()) {
   fetchTodayDekhar();
   // fetchData();
   //  getTodayDekhar();
  }

  void fetchTodayDekhar(){
    var todayDekhar = [
      "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ كَعْبَ الْأَحْبَارِ قَالَ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَيْ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يُخْسَفَ بِهِ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ.",
      "حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ قَالَ أَبُو مُعَاوِيَةَ بَعْدَكَ قَالَ قُلْ آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ.",
      "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ قَالَ سَمِعْتُ أَبِي قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْهَاجِرَةِ فَأُتِيَ بِوَضُوءٍ فَتَوَضَّأَ فَصَلَّى بِنَا الظُّهْرَ وَالْعَصْرَ وَبَيْنَ يَدَيْهِ عَنَزَةٌ وَالْمَرْأَةُ وَالْحِمَارُ يَمُرُّونَ مِنْ وَرَائِهَا.",
    "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم"];
   
      emit(doneDekkharState(todayDekhar[Random().nextInt(todayDekhar.length)]));
 
     }
    
}